In [22]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

from getpass import getpass

1. Establish a connection between Python and the Sakila database.

In [23]:
password = getpass()
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila' #use sakila
engine = create_engine(connection_string)

········

In [24]:
data = pd.read_sql_query('SELECT * FROM sakila.rental', engine) # select a small table just to make sure the database is connected
display(data.head(10))

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53
5,6,2005-05-24 23:08:07,2792,549,2005-05-27 01:32:07,1,2006-02-15 21:30:53
6,7,2005-05-24 23:11:53,3995,269,2005-05-29 20:34:53,2,2006-02-15 21:30:53
7,8,2005-05-24 23:31:46,2346,239,2005-05-27 23:33:46,2,2006-02-15 21:30:53
8,9,2005-05-25 00:00:40,2580,126,2005-05-28 00:22:40,1,2006-02-15 21:30:53
9,10,2005-05-25 00:02:21,1824,399,2005-05-31 22:44:21,2,2006-02-15 21:30:53

2. Write a Python function called rentals_month that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. The function should take in three parameters:

- engine: an object representing the database connection engine to be used to establish a connection to the Sakila database.
- month: an integer representing the month for which rental data is to be retrieved.
- year: an integer representing the year for which rental data is to be retrieved.

The function should execute a SQL query to retrieve the rental data for the specified month and year from the rental table in the Sakila database, and return it as a pandas DataFrame.

In [75]:
def rentals_month(engine, month, year):
    query = "SELECT * FROM rental WHERE MONTH(rental.rental_date) = " + str(month) + " AND YEAR(rental.rental_date) = " + str(year)
#     print(query)
    data = pd.read_sql_query(query, engine)
    return data

data2 = rentals_month(engine, '08', '2005')
data2

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,10181,2005-08-01 00:00:44,3111,113,2005-08-04 19:33:44,1,2006-02-15 21:30:53
1,10182,2005-08-01 00:08:01,4112,578,2005-08-09 18:14:01,2,2006-02-15 21:30:53
2,10183,2005-08-01 00:08:01,4319,377,2005-08-09 20:41:01,1,2006-02-15 21:30:53
3,10184,2005-08-01 00:09:33,2785,77,2005-08-05 04:12:33,2,2006-02-15 21:30:53
4,10185,2005-08-01 00:12:11,1266,64,2005-08-03 03:03:11,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
5681,16045,2005-08-23 22:25:26,772,14,2005-08-25 23:54:26,1,2006-02-15 21:30:53
5682,16046,2005-08-23 22:26:47,4364,74,2005-08-27 18:02:47,2,2006-02-15 21:30:53
5683,16047,2005-08-23 22:42:48,2088,114,2005-08-25 02:48:48,2,2006-02-15 21:30:53
5684,16048,2005-08-23 22:43:07,2019,103,2005-08-31 21:33:07,1,2006-02-15 21:30:53
5685,16049,2005-08-23 22:50:12,2666,393,2005-08-30 01:01:12,2,2006-02-15 21:30:53

3. Develop a Python function called rental_count_month that takes the DataFrame provided by rentals_month as input along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year.

The function should also include the month and year as parameters and use them to name the new column according to the month and year, for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".

Hint: Consider making use of pandas groupby()

In [76]:
def rental_count_month(df, month, year):
    rental_count = df.groupby('customer_id').size()

    rental_count.name = 'rentals_' + str(month) + '_' + str(year)    
    return rental_count.to_frame()

data3 = rental_count_month(rentals_month(engine, '07', '2005'), '07','2005')
data3

             rentals_07_2005
customer_id
1                         12
2                         14
3                         13
4                          5
5                         16
...                      ...
595                       19
596                        6
597                        7
598                       16
599                        7

[599 rows x 1 columns]

4. Create a Python function called compare_rentals that takes two DataFrames as input containing the number of rentals made by each customer in different months and years. The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.

In [81]:
def compare_rentals(df1, df2):
    df = pd.merge(df1, df2, on = 'customer_id')
    df['difference'] = df[df.columns[1]].subtract(df[df.columns[0]])
    return df

data3 = rental_count_month(rentals_month(engine, '05', '2005'), '05','2005')
data4 = rental_count_month(rentals_month(engine, '08', '2005'), '08','2005')

data5 = compare_rentals(data3, data4)
data5

             rentals_05_2005  rentals_08_2005  difference
customer_id
1                          2               11           9
2                          1               11          10
3                          2                7           5
5                          3               13          10
6                          3               12           9
...                      ...              ...         ...
594                        4                3          -1
595                        1                8           7
596                        6               13           7
597                        2               12          10
599                        1                7           6

[520 rows x 3 columns]